#include "defs.game.h"

const std::vector<std::string> defs::Building::types = {
    {"Лесопилка"},
    {"Глиняный карьер"},
    {"Железный рудник"},
    {"Ферма"},
    {"Главное здание"},
    {"Тайник"},
    {"Мукомольная мельница"},
    {"Лесопильный завод"},
    {"Кирпичный завод"},
    {"Чугунолитейный завод"},
    {"Пекарня"},
    {"Склад"},
    {"Амбар"},
    {"Посольство"},
    {"Рынок"},
    {"Резиденция"},
    {"Дворец"},
    {"Каменотес"},
    {"Сокровищница"},
    {"Водопой"},
    {"Ратуша"},
    {"Торговая палата"},
    {"Большой амбар"},
    {"Большой склад"},
    {"Пункт сбора"},
    {"Стена"},
    {"Таверна"},
    {"Академия"},
    {"Кузница"},
    {"Конюшня"},
    {"Мастерская"},
    {"Арена"},
    {"Не построено"}
};

const std::vector<std::string> defs::Resources::types = {
    "storage",
    "production",
    "maxStorage"
};
